[
    {
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "This plugin adds the ~ScatterPlot widget to ~TiddlyWiki.\n\nTo make scatter plots use the `$ScatterPlot` widget. There is also the [[scatter plot creator|$:/plugins/OokTech/ScatterPlot/Scatter Plot Creator]] to help simplying the creation process. The only required input is the data set to use. The data should be in the form of a space separated list of values. The easiest ways to do this are to either directly give the values like `<$ScatterPlot data='1 2 3 4'/>` or to transclude a field that has the values like `<$ScatterPlot data={{SomeTiddler!!values}}/>` where the values are stored in the `values` field of ~SomeTiddler.\n\nThe data can either be a sequenece of values like `1 9 4 4 5` or it can be a sequence of x,y pairs like `40,50 20,20 90,140`. I am working on adding other ways to give values.\n\nWhen the data is given as a sequence the horizontal spacing is automatically set so that the data takes up the entire width. When it is given as `x,y` pairs the data is plotted using the x and y coordinates in `px` units.\n\n|!Parameter |!Description |!Default |\n|!''data'' |The data to be plotted. It should either be a sequence of values of a sequence of x,y points. | No default |\n|!width |The width of the generated plot in pixels (`px`) |`200` |\n|!height |The height of the generated plot in pixels (`px`) |`200` |\n|!mode |The type of plot generated, options are `scatter`, `line` and `whisker` |`scatter` |\n|!symbol |The symbol to use, currenly only circle (`o`) is supported. |`o` |\n|!radius |The radius of the circles used to mark each point. |`3` |\n|!storke |The color of the stroke part of the generate symbols. |`black` |\n|!fill |The color of the fill patr of the generated symbols. |`yellow` |\n|!strokeWidth |The width of the stroke part of the generated symbols. |`1` |\n|!scale |If the plot is scaled or not. Options are `none`, `auto` or `size` |`none` |\n|!widthUnit* |The unit for the width parameter (see note below) |`px` |\n|!heightUnit* |The unit for the height parameter (see note below) |`px` |\n\n!!!Scaling\n\nThe option `size` scales the data so that it fills the entire space, that is the maximum y value of the input is mapped to the top of the plot and the minimum y value is mapped to the bottom, with minimum x on the left and maximum x on the right.\n\nThe option `auto` is like `size`, but there is a small amonut of extra space on the top and on the right side past the maximum input data values. This can make some types of plots look much nicer.\n\n*''Note'' - The widthUnit and heightUnit parameters work, but due to the coordinate system used by the plotted points the points locations are always determined using `px`, so the plot will not resize based on the width and height correctly unless they are given in `px`.\n\n\nLicense: [[BSD 3 Clause|$:/plugins/OokTech/ScatterPlot/License]]\n\nCreator: [[OokTech|$:/plugins/OokTech/OokTechInfo]]\n\nSource: [[GitHub|https://https://github.com/OokTech/TW5-ScatterPlot]]\n",
        "cpl.uri": "https://ooktech.com/TiddlyWiki/PluginLibrary/recipes/library/tiddlers/%2524%253A%252Fplugins%252FOokTech%252FScatterPlot.json",
        "cpl.title": "$:/plugins/OokTech/ScatterPlot",
        "cpl.author": "OokTech",
        "cpl.description": "A plugin to add simple scatter plots to tiddlywiki",
        "cpl.plugin-type": "plugin",
        "cpl.source": "",
        "cpl.dependents": "",
        "cpl.core-version": ">=5.1.13",
        "title": "Plugin_202304105852651"
    }
]