[
    {
        "type": "application/json",
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "This is a Control Panel extension that aims to simplify the plugin creation and editing process. After installing, you will find a new tab in your control panel that makes creating and modifying plugins a little bit easier.\n\n<a target=\"blank\" href=\"http://tinkaplugin.github.io\">Project Homepage on tinkaplugin.github.io</a>\n\n!! Version History\n\n!!! 2020-08-03 Release of version 0.5.0\n\n''Changelog''\n\n* Fixed graphical glitches with newer versions of TW5\r\n* Reworked the interface for modifying plugins\r\n* Added the ability to select and unselect all search results when adding tiddlers to plugins\r\n* `name` and `description` field are now used for both plugins and themes\r\n* Added default filter to the search\r\n* You can now attach notes to backups\r\n* Renamed control panel tabs\r\n* The version will correctly be set when creating a new plugin\n\n!!! 2017-05-13 Release of version 0.4.0\n\nThis release fixes the following bugs:\n\n''Changelog''\n\n* Themes will now get the correct prefix `$:/themes/` when packaging\r\n* Fixed search results not linking properly\r\n* Added description field when creating a new theme\n\n\r\n!!! 2017-03-01 Release of version 0.3.0\n\nAfter more than a year, Tinka is now on <a target=\"blank\" href=\"http://tinkaplugin.github.io\">github</a> and also released under the [[MIT license|$:/plugins/ahahn/tinka/license]].\n\n''Changelog''\n\n* Packaging success now produces a modal that actively reminds the user to refresh the wiki.\r\n* The search tab state is now kept in a temporary system tiddler.\r\n* Added warning when repackaging themes that are not active.\r\n* The 'Help Tab' functionality is now also available for plugins that do not follow the `$:/plugins/...` naming convention. In particular this applies to themes and core plugins.\r\n* Fixed wrong headings for some modal dialogs.\r\n* Older action widgets remodeled to use the (new) CommonAction widget as a base.\r\n* Fixed error check that prevented users to enter a minimal core version dependency when creating a new plugin.\n\n!!! 2015-09-20 Release of version 0.2.0-beta\n\n''Changelog''\n\n* Added Help-Tab capabilities to quickly navigate between plugin tiddlers.\r\n* Moved Create-Plugin wizard to its own tab.\r\n* Redid Create-Plugin UI to be easier and more accessible.\r\n* Backups can now also be downloaded/exported.\r\n* Added more documentation.\n\n!!! 2015-05-18 Release of version 0.1.0\n\n''Changelog''\n\n* The metadata section now include edit fields for the `name` and `source` fields.\r\n* The //default search// box now only searches for title matches.\r\n* Backups can now be exported/downloaded.\r\n* <div>Backups can now be restored and made active again. If another version of the plugin is already active, the option is given to back it up,before restoring the backup.\n\n\r\n''Warning: For this mechanism to work, there has to be an 'original-title' field present in the backup tiddler. This is automatically added by Tinka, however earlier versions of Tinka did not add this field. If you want to restore a backup from an earlier version of Tinka, you will have to add the 'original-title' field manually and populate it with the former title of the plugin tiddler, in order for the restore function to work.''\r\n</div>\n\n!!! 2015-04-30 Release of version 0.0.2\n\n''Changelog''\n\n* The list of plugin tiddlers is now hidden by default, since some lists can get very long.\r\n* Added a different search option (default/filter)\r\n* Improved Documentation slightly\r\n* Added a backup option, so a plugin can be backed up before repackaging.\n\n   \r\n!!! 2015-04-29 Release of version 0.0.1\r\n",
        "cpl.uri": "https://raw.githubusercontent.com/TinkaPlugin/Tinka/master/output/tinka.tid",
        "cpl.title": "$:/plugins/ahahn/tinka",
        "cpl.author": "Andreas Hahn",
        "cpl.name": "Tinka",
        "cpl.description": "An easy plugin packer",
        "cpl.plugin-type": "plugin",
        "cpl.source": "https://tinkaplugin.github.io",
        "cpl.dependents": "",
        "cpl.core-version": ">=5.1.20",
        "title": "Plugin_202203224905648"
    }
]