{"title":"$:/plugins/Gk0Wk/CPL-Repo","name":"CPL Repo","author":"Gk0Wk","version":"2023.12.9","plugin-type":"plugin","icon":"","core-version":">=5.3.0","dependents":"","parent-plugin":"","requires-reload":true,"category":"Functional","tags":"CPL [[Plugin Libaray]] Network Essential","description":"Essential and powerful plugin manager and library","readme":"<div style=\"display:flex;justify-content:center;\">\n{{$:/plugins/Gk0Wk/CPL-Repo/about-banner}}\n</div>\n\n<$list filter=\"[[$:/language]get[text]removeprefix[$:/languages/]else[en-GB]search[zh]then[yes]else[no]]\" variable=\"chinese\">\n\n<$list filter=\"[<chinese>match[yes]]\">\n\n> 好用到哭，装就完了!\n\n!! 欢迎使用 CPL!\n\n使用 TW 这么久，你还在为四处寻觅好用的插件而发愁吗？还在为管理一大堆插件的更新、处理插件的依赖而苦恼吗？你还在为查找插件的用法而翻遍全网吗？你是否希望安装一个插件的某个历史版本，而非最新版本？\n\n如果你是插件的作者，你是否还在苦恼如何推广自己的插件，如何让用户及时获得最新的版本呢？\n\n你是否希望 TW 能像其他现代笔记软件一样，能够一键管理所有插件，能够更傻瓜化地查找和安装插件，甚至主动为你推广插件。是否希望 TW 能够帮助你自动保持插件的最新？\n\n这一切，在 CPL 得以实现！\n\n---\n\nCPL 是由[[太微(TiddlyWiki)中文社区|https://github.com/tiddly-gittly]]维护的、致力于搜集网络上所有与 <$text text={{{ TiddlyWiki5 }}}/> 有关插件的、希望为中国以及全世界的太微用户提供一键安装、更新插件体验的插件聚合中心。\n\n本插件有如下特点：\n\n* 聚合各种 TW 插件并保持最新当前 500+;\n* 在你的 Wiki 中搜索各种插件，提供关键词、分类和标签搜索;\n* 自动检查插件更新;\n* 安装插件时可自动递归安装依赖，并可以指定所有插件的安装版本;\n\n</$list>\n\n<$list filter=\"[<chinese>match[no]]\">\n\n> Just install it! I think you need it.\n\n!! Welcome to CPL!\n\nAfter using TW for so long, are you still worried about looking around for good plugins? Are you still struggling to manage a bunch of plugin updates and deal with plugin dependencies? Are you still searching the web to find out how to use a plugin? Do you want to install some historical version of a plugin instead of the latest version?\n\nIf you are a plugin author, do you still struggle with how to promote your plugin and how to keep users up to date with the latest version?\n\nDo you wish TW could manage all your plugins with one click like other modern note-taking software, make it more foolproof to find and install plugins, and even proactively promote plugins for you? Do you want TW to help you keep your plugins up-to-date automatically?\n\nIt's all here at CPL!\n\n---\n\nThis plugin source is maintained by the [[TiddlyWiki Chinese Community|https://github.com/tiddly-gittly]] and is dedicated to collecting all <$text text={{{ TiddlyWiki5 }}}/> related plugins on the web, hoping to provide a one-click installation and update plugin experience for TW users all around the world.\n\nThis plugin has the following features:\n\n* Aggregate various TW plugins and keep them up-to-date with the current 500+;.\n* Search for various plugins in your Wiki, providing keyword, category and tag search;.\n* Check for plugin updates automatically;\n* Install plugins with automatic recursive installation of dependencies, and you can specify the installed version of all plugins;\n\n</$list>\n\n</$list>","latest":"2023.12.9","versions":["2023.10.11","2023.10.14","2023.10.15","2023.10.20","2023.12.9"],"versions-size":{"2023.10.11":97301,"2023.10.14":104136,"2023.10.15":105621,"2023.10.20":105621,"2023.12.9":100525}}