{"title":"$:/plugins/felixhayashi/tiddlymap","author":"Felix Küppers and Cameron Fischer","name":"TiddlyMap","description":"Map drawing and topic visualization for your wiki","readme":"<$button class=\"tc-btn-invisible\" style=\"overflow: hidden;white-space: pre;width: 100%;\" message=\"tm-open-external-window\" param=\"https://github.com/felixhayashi/TW5-TiddlyMap\">{{$:/core/images/github}} <$text text=\"https://github.com/felixhayashi/TW5-TiddlyMap\"/></$button>\n\n<$button class=\"tc-btn-invisible\" style=\"overflow: hidden;white-space: pre;width: 100%;\" message=\"tm-open-external-window\" param=\"http://tiddlymap.org/\">{{$:/core/images/home-button}} <$text text=\"http://tiddlymap.org/\"/></$button>\n\nTiddlyMap is a TiddlyWiki plugin that turns your favourite personal note taking software in a wiki-concept-map hybrid. Yes, you will be able to do both: drawing maps and putting down knowledge in a wiki way. TiddlyMap will allow you to visually link and create wiki topics in order to create clickable graphs, e.g. concept maps or dependency graphs. Moreover it will automatically visualize your topic structures so you get an immediate grasp of topics and relations.\n\n[img[screenshot|https://cloud.githubusercontent.com/assets/4307137/9981521/384afc1a-5fc0-11e5-92bc-2c2ce5996766.png]]\n\n!! Motivation\n\nThe motivation behind TiddlyMap is to combine the strengths of wikis and concept maps in the realms of personal knowledge management in a single application.\n\nHave you ever created mind- or concept maps and later wished you could turn them into a wiki because they became too complex and too hard to maintain? On the contrary, have you ever worked with a wiki and felt that it is lacking visual means to express your thoughts and to relate your content? – If yes, then TiddlyMap is certainly what you are looking for.\n\n!! Fundaments\n\nTiddlyMap is based on two popular open-source projects.\n\nTiddlyWiki, a personal wiki software developed by Jeremy Ruston, is used as runtime environment. TiddlyWiki is a unique non-linear notebook for capturing, organising and sharing complex information. It is a highly interactive application that is stored in a single file.\n\n> TiddlyWiki has bought unprecedented freedom to people to keep their precious information under their own control. – tiddlywiki.com\n\nVis.js is used for graph visualization and manipulation. Vis.js is a dynamic, browser based visualization library actively developed and maintained by a team of great developers working at Almende B.V.\n\n> The library is designed to be easy to use, handle large amounts of dynamic data, and enable manipulation of the data – visjs.org\n\n!! License\n\nTiddlyMap is distributed under the BSD 2-Clause License. By using this plugin you agree to the product's License Terms.","version":"0.17.19+10023","plugin-type":"plugin","dependents":"$:/plugins/felixhayashi/vis","core-version":">=5.1.5","requires-reload":false,"category":"Unknown","type":"application/json","latest":"0.17.19+10023","versions":["0.17.16+10020","0.17.17+10021","0.17.18+10022","0.17.19+10023"],"versions-size":{"0.17.16+10020":340788,"0.17.17+10021":340772,"0.17.18+10022":341021,"0.17.19+10023":341030}}