[
    {
        "title": "Plugin_202203222518048",
        "type": "application/json",
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "!! What ia slider plugin?\nSlider is a small plugin to create an ordered set of tiddlers also called ''Trail''.\n\nA slideshow can be used to create a sequence of selected contents like step by step tutorial, guided help, lessons and similar.\n\nThe slider plugin user interface contains three sections\n\n# A sidebar tab called ''Trails'' to manage trails\n# A ''dashboard'' for each slideshow (where slideshow structure is managed)\n# Tiddlers in a slideshow, also called ''slides''\n\n!! How to create a slideshow\nFrom the sibebar tab ''Trails'' click on the ''Create new slideshow'' button. In the newly opened tiddler:\n\n# Enter a short name for //title//\n#* This title is used as a parent //tag// for all slides in the slideshow\n# Enter a meaningful caption to describe the subject of slideshow\n#* Caption is displayed in ''Trails'' sidebar tab, so it used to find and recognize the slideshow\n# Save the tiddler\n#* After saving the dashboard will be appeared\n#* Using dashboard, manage the slideshow\n\n!! Add slides to slideshow\nSlides (tiddlers) can be added to a specified slideshow in several ways including:\n\n# By clicking on the `New slide` button on the slideshow dashboard\n# By dragging and droping a tiddler into the `List of slides` on the slideshow dashboard\n# By opening the `sidebar / Trails` tab and then clicking on the `Add slide to ...` button\n# By creating new tiddler and tagging with the specified slideshow title\n# By tagging an exisiting tiddler with the specified slideshow title\n\n!! Create slide footer \n* The slider footer can be used to add a text to all slides in a slideshow.\n* The slider footer is an ordinary tiddler and can be opned and edited\n* The slider footer has the same title of slideshow with `-Footer` prefix and tagged with `slideFooter`\n* The footer can be used for date stamp, author and institution name or any other information you like.\n* The footer can be formatted for color, size, font and etc. It can accept all the standard markup.\n\n!! Navigate through slides\n# Set the desired slideshow as the active slideshow by opening it and clicking on `Set for presentation`\n# From the //List of slides// click on the first slide or any slide you like to start from\n# One the footer of newly opened slide, click on the next button to navigate to the next slide\n# You can click on the slide-list button to open a local window and see the list of all slides, then you can click on any slide you like and jump to that slide\n# The slide footer also has a //previous// button which lets to navigate to previous slide in the list\n\n\n!! Demo\nThere few trails for demonstration on\nhttps://kookma.github.io/Tiddlyshow/\n\n!! Installation\nSimply drag and drop the below ling into your wiki\n\n* $:/plugins/kookma/tiddlyshow",
        "cpl.uri": "https://kookma.github.io/TW-PluginLibrary/library/recipes/library/tiddlers/%2524%253A%252Fplugins%252Fkookma%252Ftiddlyshow.json",
        "cpl.title": "$:/plugins/kookma/tiddlyshow",
        "cpl.author": "Mohammad Rahmani",
        "cpl.description": "Tiddlyshow",
        "cpl.plugin-type": "plugin",
        "cpl.source": "https://github.com/kookma/Tiddlyshow",
        "cpl.dependents": "",
        "cpl.core-version": ">=5.1.21"
    }
]