[
    {
        "title": "Plugin_202203224630601",
        "type": "application/json",
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "This plugin is a simple versioning system for edited tiddlers, recorded as they are saved. It works though the following buttons:\n\n* {{$:/plugins/jd/plainrevs/images/done-button}} will not just save the tiddler as usual, but will also save the previous version of that tiddler (all fields including //tags//, except //title//).\n\n* {{$:/plugins/jd/plainrevs/images/delete-button}} will not just delete the tiddler as usual, but will also delete that tiddler's revisions.\n\nA ''Revisions'' tab can be found under ''info'' {{$:/core/images/info-button}}, and from there the following actions can be done to each revision:\n\n* → / ↓ : show the revision list as horizontal or vertical tabs\n* ''(show differences)'' / ''(hide differences)'' : shows/hides the differences between the revision and the current state of the tiddler.\n* ''(restore)'' : replace the current state of the tiddler with that revision (all fields including //tags//, except //title//).\n* ''(pin)'' / ''(unpin)'' : makes it so that the revision will not be deleted when the source tiddler is deleted, nor when the user-defined limit of revisions is reached.\n* ''(delete)'' : deletes that revision, pinned or not.\n\n!!! ''Changing the source tiddler's title''\n\n* The source tiddler's title may be changed; its rev tiddlers will always follow it as long as \"//Update (oldtitle) to (newtitle) in the tags and list fields of other tiddlers//\" is checked when editing the source tiddler's title.\n\n!!! ''Blacklisting''\n\nThe ''keep-rev'' field of a tiddler will define how many revisions will be kept for that tiddler. Defaults to 3 if the field does not exist, or if it is empty. Here are other possible values for the field:\n\n* `no`: no revision will be saved\n\n* `all`: all revisions will be saved / no limit\n\n* `0`: same as \"all\". Use \"no\" instead if no revision should be kept\n\n* any `integer` greater than `0`: that number of revisions will be saved\n\n!!! ''Rev tiddler structure''\n\n```\ntitle: $:/rev/<<now YYYY0MM0DD.0hh:0MM:0ss>>\nlist: [[Title of source tiddler]]\nrev-list: listItems [[inside list field]] of [[source tiddler]]\nrev-tags: [[tag 1]] tag2\nrev-someotherfield: someotherfield's value\n... and all other fields of source tiddler, to be prefixed 'rev-'\n```\n\nIf  the title already exists, it is incremented numerically. \n\nRestoring the revision will re-copy the stored rev-fields (the \"rev-\" prefix will be removed). \n\n!!! ''Notes''\n\nThe ~$:/core ''save'' and ''delete'' buttons are neither replaced nor overwritten. You can still use them alongside this plugin's buttons by setting their visibility at ~$:/ControlPanel > Appearance > Toolbars\n\n<a target=\"blank\" href=\"http://j.d.revisions.tiddlyspot.com/\">Project Homepage on Tiddlyspot</a>",
        "cpl.uri": "http://j.d.tiddlyspot.com/index.html",
        "cpl.title": "$:/plugins/jd/plainrevs",
        "cpl.author": "JD",
        "cpl.description": "Plain Revisions",
        "cpl.plugin-type": "plugin",
        "cpl.core-version": ">=5.1.17"
    }
]