[
    {
        "title": "Plugin_202203224447347",
        "type": "application/json",
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "This plugin is meant to show connections up front, and to act as a better table of content on index tiddlers. It has the core features:\n\n* at the bottom of every tiddler'' all references is shown'' in lists.\n** tags\n** backlinks\n** Freelinks\n** list (the content of the list field of the present tiddler)\n** listed (other tiddlers that have the tiddler in there list field)\n* ''all lists are collapsible''. All sublists can be closed/opened by clicking on the header for the list. \n* ''all lists are conditional'', the lists will ONLY appear if there is something in them (e.g. if you don't see the backlink list, it is because there are no backlinks to that tiddler)\n** if no tags/links/list/listed are present nothing is shown. The primary toggle (references button) is also hidden\n*'' show content of all tiddlers'' (transclusions) in the lists (1. button to the right of \"references\")\n** also recursive through the tags table of content\n** hide all content with a button at the end of lists (handy for long lists)\n** the grey text-box is a link to the tiddler\n* ''show content of individual tiddlers'' (transclusions) in the lists (activate with 2. button to the right of \"references\" and toggle at each individual tiddler in the list)\n* ''show modified/created date'' in bottom right corner of transcluded tiddlers (toggle in settings)\n\nin addition it is \n\n*mobile friendly\n** no hover (better for touchscreens)\n** vertical layout with few clicks (better for scrolling)\n*print friendly\n** buttons is hidden on print\n** if something is collapsed, or everything is collapsed, the button are also hidden on print\n*customisable\n** name of primary \"references\" heading/button is changeable in the [[settings|$:/plugins/HCHaase/TOCgeneric/settings]]\n** default visibility for lists is changeable in [[settings|$:/plugins/HCHaase/TOCgeneric/settings]]\n\nYou can customise the look and function in the [[settings|$:/plugins/HCHaase/TOCgeneric/settings]] to fit your needs.\n\n\n!! Why I made this\n\nThis was inspired by the forum discussion on [[bi-directional linking|https://groups.google.com/forum/#!topic/tiddlywiki/LUVTps01UBU]] to show tiddler connection better.\n\nThis is an attempt to make all connections more visible for all tiddlers. You can see the same information in the info panel of the tiddlers, but this hopefully make the connections stand out more.\n\n!! Acknowledgement\n\nThanks to\n\n* David Gifford (transclusion taken from the  [[TiddlyBlink edition|https://giffmex.org/gifts/tiddlyblink.html]])\n* Mohammad for help with [[filtering|https://groups.google.com/forum/#!topic/tiddlywiki/tOeRa6973As]]\n* TonyM for help with [[custom exclusion of tiddlers|https://groups.google.com/d/msg/TiddlyWiki/KZWhS-BtZCQ/WWpDZIREBQAJ]] (coming soon)\n* Akhator (freelinks filter copied from  [[TWCrossLinks|https://akhater.github.io/drift/#%24%3A%2Fak%2Fplugins%2FTWCrossLinks]])\n\n\nI and David developed our plugins around the same time, but when I stopped, David continued to develop lots of cool features, so I borrowed a little from him. The code for transcluding tiddler content is adopted form David Gifford's [[TiddlyBlink edition|https://giffmex.org/gifts/tiddlyblink.html]]. \n\n!!!!What's the difference  between TiddlyBlink and TOC generic?\nTiddlyBlink is more focused on linking and have a complete setup for building a link centred wiki. The TOC generic plugin can use ''tags ''as well as links and are more focused on showing information and connections, not editing. TOC generic is a plugin and can be used in any wiki with a pre-existing organisation.\n\n!! Road map\n\nAt some point I want to \n\n*~~ incorporate transclusions from Daves BiLink plugin~~\n*~~toggle transclusion for individual list items~~\n* make a alternative sort button\n* colour code boxes according to tags (or other stuff??)( make a tag picker secondary/tetriary sorter/indexer)\n* Add an exclude-filter (e.g. exclude advanced search)\n* (maybe) make toc by custom (input) filter (like Pmario's tocp) / use any field sorting to make a toc\n* (maybe) Add set start of toc like Tonys example (https://groups.google.com/forum/#!topic/TiddlyWiki/wijV7wNnwpQ)",
        "cpl.uri": "https://hchaase.github.io/HC-Plugins/index.html",
        "cpl.title": "$:/plugins/HCHaase/TOCgeneric",
        "cpl.author": "HC Haase",
        "cpl.name": "TOC Generic",
        "cpl.description": "TOC Generic - adds extended TOC to the bottom of tiddlers",
        "cpl.plugin-type": "plugin",
        "cpl.source": "https://hchaase.github.io/HC-Plugins/",
        "cpl.core-version": "5.1.21"
    }
]