[
    {
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "!! Tiddlywiki Gravatar\n\nThis plugin provides a convenient way to use Gravatar in TiddlyWiki. Gravatar is a service that allows users to create a unique avatar, which is an image that represents them online. This plugin supports Gravatar, QQ, and GitHub avatars, and allows users to easily maintain a consistent online identity across different platforms. The plugin also provides an example of how to use the different avatar types and includes a configuration file for setting the default email address.\n\n!! Intro\n\n> Gravatar stands for Globally Recognized Avatar. It is a service that allows users to create a unique avatar, which is an image that represents them online. This avatar can then be used across different websites, forums, and platforms that support Gravatar.\n> Gravatar is a free service that is owned by Automattic, the company behind WordPress. It works by linking an email address to an avatar, so whenever a user comments or posts on a website that supports Gravatar, their avatar will automatically appear next to their name.\n> Gravatar is a convenient way for users to maintain a consistent online identity across different platforms. It also helps website owners to easily identify and recognize their regular commenters and engage with them.\n\n!! Example\n\n* <$avatar type=\"GitHub\"/>\n* <$avatar email=\"xxx\"/>\n* <$avatar email=\"xxx\" type=\"gravatar\"/>\n\n!! usage\n\n* 支持 qq gravatar GitHub\n\n`$:/config/plugins/oeyoews/tiddlywiki-gravatar/email` is email config file\n\n```\n<$avatar />\n```\n",
        "cpl.uri": "https://oeyoews.github.io/tiddlywiki-starter-kit/library/recipes/library/tiddlers/%2524%253A%252Fplugins%252Foeyoews%252Ftiddlywiki-gravatar.json",
        "cpl.title": "$:/plugins/oeyoews/tiddlywiki-gravatar",
        "cpl.author": "oeyoews",
        "cpl.name": "Tiddlywiki Gravatar",
        "cpl.description": "Tiddlywiki Gravatar",
        "cpl.plugin-type": "plugin",
        "cpl.dependents": "",
        "cpl.core-version": ">=5.3.0",
        "title": "Plugin_202309190903791"
    }
]