[
    {
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "This plugin enables TiddlyWiki to save tiddlers in [[browser local storage|https://en.wikipedia.org/wiki/Web_storage#localStorage]]. This means that changes are stored within the browser, and automatically re-applied any time the base wiki is reloaded.\n\nAt startup, the plugin reads tiddlers from local storage. Any tiddlers that are identical to those built into the file are deleted from local storage. Once the wiki is up and running, any tiddler changes are written straight to local storage.\n\nBrowser local storage is not a panacea for TiddlyWiki:\n\n* Browsers limit the amount of local storage available to a page, typically to 5 or 10MB\n* Keeping personal data in browser local storage can lead to unexpected privacy violations\n* Browsers reserve the right to without warning delete data stored in local storage at any time\n* Browsers tie local storage to a URL which can lead to problems if you move a wiki to a URL previously occupied by a different wiki\n\nPlease use this plugin with caution. There are a number of unresolved issues and open questions:\n\n* Innerwikis read the local storage of their parent wikis\n* This plugin does not interfere with the existing saver mechanism, so you'll still get warnings when refreshing the page, even if your changes are safely committed to local storage\n* There is a possibility that tiddlers might be transferred between different wikis if they are accessed via the same URL. This is particularly likely when running in local client server configuration under Node.js\n",
        "cpl.uri": "https://tiddlywiki.com/library/v5.2.7/recipes/library/tiddlers/%2524%253A%252Fplugins%252Ftiddlywiki%252Fbrowser-storage.json",
        "cpl.title": "$:/plugins/tiddlywiki/browser-storage",
        "cpl.name": "Browser Storage",
        "cpl.description": "Local storage in the browser",
        "cpl.plugin-type": "plugin",
        "cpl.dependents": "",
        "title": "Plugin_202303171550357"
    }
]