[
    {
        "tags": "$:/tags/PluginWiki",
        "cpl.readme": "\\define show-example(name)\n<$let title={{{ [[$:/plugins/tiddlywiki/confetti/examples/]addsuffix<__name__>] }}}>\n\nFor example:\n\n<$macrocall $name=\"copy-to-clipboard-above-right\" src=<<__src__>>/>\n\n<$codeblock code={{{ [<title>get[text]] }}}/>\n\nRenders as:\n\n<$transclude tiddler=<<title>> mode=\"block\"/>\n\n</$let>\n\\end\n\n! Introduction\n\nThis plugin adds a programmable confetti cannon to your TiddlyWiki. It is based on https://www.kirilv.com/canvas-confetti/ by Kiril Vatev.\n\n! Usage\n\nThe confetti cannon can be controlled using messages or via the `<$confetti>` widget. Use the message approach when triggering confetti in response to an action (such as clicking a button). Use the widget approach when confetti is to be triggered by a condition (such as a target number of words being reached).\n\n!! Messages: tm-confetti-launch and tm-confetti-reset\n\nThe `tm-confetti-launch` message launches the confetti cannon. See below for the available parameters.\n\nThe `tm-confetti-reset` message cancels any confetti that is in progress.\n\n<<show-example staggered>>\n\n!! Widget: `<$confetti>`\n\nThe `<$confetti>` widget launches the confetti cannon when it is first rendered. See below for the available attributes.\n\nTypically it is used in conjunction with a `<$list>` or `<$reveal>` widget that shows the widget when the conditions required to trigger the confetti are satisfied.\n\nIn this example, the confetti will be launched when the word \"launch\" in typed into the box.\n\n<<show-example typing-trigger>>\n\n!! Confetti Launch parameters\n\nThe following options are supported:\n\n|!Name |!Description |!Default |\n|''delay'' |Number of milliseconds to delay the launch |0 |\n|''particleCount'' |The number of confetti to launch |50 |\n|''angle'' |The angle in which to launch the confetti, in degrees (90 is straight up) |90 |\n|''spread'' |How far off center the confetti can go, in degrees. 45 means the confetti will launch at the defined `angle` plus or minus 22.5 degrees |45 |\n|''startVelocity'' |How fast the confetti will start going, in pixels |45 |\n|''decay'' |How quickly the confetti will lose speed. Keep this number between 0 and 1, otherwise the confetti will gain speed |0.9 |\n|''gravity'' |How quickly the particles are pulled down. 1 is full gravity, 0.5 is half gravity, etc. |1 |\n|''drift'' |How much to the side the confetti will drift. The default is 0, meaning that they will fall straight down. Use a negative number for left and positive number for right |0 |\n|''ticks'' |How many times the confetti will move (this is an abstract quantity; the designed recommends playing with it if the confetti disappears too quickly for you) |200 |\n|''originX'' |The `x` position on the page, with `0` being the left edge and `1` being the right edge |0.5 |\n|''originY'' |The `y` position on the page, with `0` being the top edge and `1` being the bottom edge |0.5 |\n|''colors'' |A space separated list of color strings in hex format (eg `#bada55` or `#ce5`) | |\n|''shapes'' |A space separated list of shapes for the confetti. The possible values are `square`, `circle`, and `star`. The default is to use both squares and circles in an even mix. To use a single shape, you can provide just one shape in the list, such as `star`. You can also change the mix by providing a value such as `circle circle square` to use two third circles and one third squares | |\n|''scalar'' |Scale factor for each confetti particle. Use decimals to make the confetti smaller |1 |\n|''zIndex'' |Z-index of confetti. Increase the value if the confetti is appearing behind other on-screen elements|100 |\n|''disableForReducedMotion'' |Set to `yes` to entirely disable confetti for users that [[prefer reduced motion|https://developer.mozilla.org/en-US/docs/Web/CSS/@media/prefers-reduced-motion]] |`no` |\n",
        "cpl.uri": "https://tiddlywiki.com/library/v5.3.4/recipes/library/tiddlers/%2524%253A%252Fplugins%252Ftiddlywiki%252Fconfetti.json",
        "cpl.title": "$:/plugins/tiddlywiki/confetti",
        "cpl.name": "Confetti",
        "cpl.description": "Animated confetti effect",
        "cpl.plugin-type": "plugin",
        "cpl.dependents": "",
        "title": "Plugin_tiddlywiki_confetti"
    }
]