[
    {
        "created": "20220322101431941",
        "title": "Plugin_202203224001765",
        "type": "application/json",
        "tags": "$:/tags/PluginWiki",
        "modified": "20220322101433701",
        "cpl.readme": "!!! Compatibility checked with ''TW 5.1.17'' & ''TW 5.1.22'' only!\n\nThis theme uses an overhauled sidebar, which can be accessed via a hamburger button at the topright or topleft of the screen. I turned this into a theme just to make it easier for me to move it around my TW5's. \n\n''The hamburger button:''\n\n* When the sidebar is minimized, hovering on the hamburger button will expand the sidebar. The sidebar will minimize when it loses mouse focus. Clicking on the hamburger button will make the sidebar \"sticky\" until it is clicked again.\n\n* Below the hamburger button (when sidebar is minimized) are the usual Page Control buttons. \n\n''Changes to the sidebar:''\n\n# Minimize-able via the hamburger button\n# Movable to the left or the right of the screen\n# Sidebar tabs are turned into draggable, removable, and minimize-able \"card\"-things\n\n''Changes to the sidebar tabs:''\n\n# Draggable = click on the card title + drag above or below other \"cards\" in the sidebar\n# Removable = hover on card title + click the right-most button that appears\n# Minimize-able = click on the card title (expand by clicking again)\n* The card title is the \"caption\" of the tiddler. Otherwise, it's the tiddler title\n\n''~PageControls:''\n\n* ~PageControls appear beside the hamburger button on hover (when sidebar is expanded), or below it when sidebar is \"minimized\"\n\n<hr>\n\n!!! Compatibiliy with ''Stories'' Plugin\n\nhttps://giffmex.org/stroll/empty.html#%24%3A%2Fplugins%2Fsq%2FStories\n\nFor compatibility with the great 2-story plugin above, please also import this to your wiki:\n\n<<<\n''~$:/themes/jd/Whitespace/Stylesheet/StoriesPluginCompatibility''\n[[get it here|http://j.d.whitespace.tiddlyspot.com/#Compatibility%20with%20''Stories''%20Plugin]]\n<<<\n\n<hr>\n\n//Note:// \n\nThis theme is best used with [[Very Simple Mobile Layout (plugin)|http://j.d.tiddlyspot.com/#Very%20Simple%20Mobile%20Layout%20(plugin)]].\n\n<a target=\"blank\" href=\"http://j.d.whitespace.tiddlyspot.com\">Project Homepage on Tiddlyspot</a>\n\n<hr>\n\n```\n'20/07/27 : fixed the story river scrolling issue (finally!) just by using a <$scrollable/> widget\n```\n\n<hr>\n\n//MIT License://\n\nCopyright 2020 jologsdialogue@gmail.com\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
        "cpl.uri": "http://j.d.whitespace.tiddlyspot.com/index.html",
        "cpl.title": "$:/themes/jd/Whitespace",
        "cpl.author": "jd",
        "cpl.name": "Whitespace",
        "cpl.description": "Lots of unused, negative space; an experiment on TW5 design",
        "cpl.plugin-type": "theme",
        "cpl.dependents": "$:/themes/tiddlywiki/vanilla",
        "cpl.core-version": ">=5.1.17",
        "page-cover": "https://nesslabs.com/wp-content/uploads/2020/04/whitespace-tw-theme-screenshot.png"
    }
]