[
    {
        "created": "20221124032753153",
        "creator": "WhiteFall",
        "title": "Plugin_202211242753153",
        "modified": "20221124040339476",
        "modifier": "WhiteFall",
        "tags": "$:/tags/PluginWiki",
        "type": "text/vnd.tiddlywiki",
        "uri": "",
        "_title": "",
        "_type": "plugin",
        "author": "",
        "cpl.author": "jcose",
        "cpl.description": "巨型菜单",
        "cpl.documentation": "https://jc-ose.github.io/MegaMenu/index.html",
        "cpl.name": "MegaMenu",
        "cpl.title": "$:/plugins/jcose/MegaMenu",
        "cpl.uri": "https://jc-ose.github.io/MegaMenu/index.html",
        "description": "",
        "name": "",
        "cpl.readme": "!! Description\nThis plugin provides the `megamenu` macro. Which generates a useful menu for navigating through your wiki using relationships between your tiddlers - as defined by the tags you've probably already setup. \n\n!! Installation\nFirst ensure your wiki version is >=5.1.23. This plugin does not work fully on earlier versions of TiddlyWiki. \n\nDrag [[$:/plugins/jcose/MegaMenu]] into your wiki. \n\n!! Syntax\n```\n<<megamenu maintag:\"MyTag\" statetid:\"MyStateTiddler\">>\n```\n\n!! Usage\n!!! Macro Inputs\n# ''maintag'': The root tag that the menu starts from. You'll want this to be the highest level tag that your wiki starts at. \n#* (Optional) Defaults to: \"~TableOfContents\"\n# ''statetid'': The title of a state tiddler for holding information about the current menu.\n#* (Optional) Defaults to: \"~$:/plugins/jcose/MegaMenu/DefaultState\"\n#* This is only needed if you plan to have multiple of these menus in your wiki.\n\n!!! Navigating the Menu\n* This menu will at any time show three levels of links to the user, with the possibility to dive deeper by changing the root tag (more on this later).\n* This root tag is defined in the top left: right under the MENU title. Whatever is shown here is the root to all the other information shown on the menu. It defaults to the tag specified by the `maintag` input to the macro. \n* Under that, still on the left side, you will find a list of tiddlers that are tagged directly with the root. \n* Any of these options on the left can be clicked to further populate the right side of the menu with links to tiddlers tagged with that tiddler/tag. Effectively showing the next level down of your tag hierarchy.  \n* The right side of the menu has the additional feature of grouping links to tiddlers that have more than one tag in common. \n** You will find groups for tiddlers that are tagged with the selected option on the left AND another tag for context. \n** You will also find a group for tiddlers that are tagged with only the selected option. \n* You can change the root link to dive deeper into your wiki by clicking the double-up arrow button (called chevron-up in the core nomenclature). As described in the Controls section below. \n** On the top portion of the menu, you can trace the path you took to get to the currently displayed root tag using the displayed breadcrumbs. You can click any link along that path to reset the root to that value. \n\n\n!!! Controls\n\n{{$:/core/images/chevron-up}} - Change the root tag to the tag next to this button. \n\n{{$:/core/images/close-button}} - Reset the root tag to it's original value specified in the macro call. \n\n{{$:/core/images/link}} - Navigate to the tiddler with the same name as the tag next to this button. \n\n{{$:/core/images/new-here-button}} - Create a new tiddler tagged with this.\n\n\n!! Static Example (Controls do not function here)\n{{$:/plugins/jcose/MegaMenu/Example}}\n\n!! Full Example\n> A great test that showcases the power of this menu is to try it in the tiddlywiki documentation. \n# Open [ext[https://tiddlywiki.com/]]\n# Install this plugin as explained above. \n# Create a tiddler and add this macro to the text of the tiddler `<<megamenu>>`\n# Explore!\n\n!! Change Theme\n{{$:/plugins/jcose/MegaMenu/ThemeSelect}}\n\n!! Alternative\nFor a simpler alternative, you can use the `<<simplemenu maintag>>` macro, which removes the leftbar from the menu and only shows groups of tiddlers tagged with the `maintag` input. Unlike the main version, this menu is static and does not change."
    }
]
